cmsis-svd/cmsis-svd/data/Atmel/ATSAML11E16A.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GCLK</name>
         <version>U21221.1.2</version>
         <description>Generic Clock Generator</description>
         <groupName>GCLK</groupName>
         <prependToName>GCLK_</prependToName>
         <baseAddress>0x40001C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x104</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchroniation Busy bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENCTRL0</name>
                     <description>Generic Clock Generator Control 0 Synchronization Busy bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENCTRL1</name>
                     <description>Generic Clock Generator Control 1 Synchronization Busy bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENCTRL2</name>
                     <description>Generic Clock Generator Control 2 Synchronization Busy bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENCTRL3</name>
                     <description>Generic Clock Generator Control 3 Synchronization Busy bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENCTRL4</name>
                     <description>Generic Clock Generator Control 4 Synchronization Busy bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>GENCTRL[%s]</name>
               <description>Generic Clock Generator Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC oscillator output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKIN</name>
                           <description>Generator input pad</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKGEN1</name>
                           <description>Generic clock generator 1 output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSCULP32K</name>
                           <description>OSCULP32K oscillator output</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>XOSC32K oscillator output</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC16M</name>
                           <description>OSC16M oscillator output</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFLLULP</name>
                           <description>DFLLULP output</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FDPLL96M</name>
                           <description>FDPLL output</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GENEN</name>
                     <description>Generic Clock Generator Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDC</name>
                     <description>Improve Duty Cycle</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOV</name>
                     <description>Output Off Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIVSEL</name>
                     <description>Divide Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Division Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>21</dim>
               <dimIncrement>4</dimIncrement>
               <name>PCHCTRL[%s]</name>
               <description>Peripheral Clock Control</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GEN</name>
                     <description>Generic Clock Generator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>GENSelect</name>
                        <enumeratedValue>
                           <name>GCLK0</name>
                           <description>Generic clock generator 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK1</name>
                           <description>Generic clock generator 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK2</name>
                           <description>Generic clock generator 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK3</name>
                           <description>Generic clock generator 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK4</name>
                           <description>Generic clock generator 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
